operational_systems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Operational Systems</title>
<!-- 2017-07-19 Wed 15:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yury" />
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="content">
<h1 class="title">Operational Systems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Загрузка системы</a></li>
<li><a href="#sec-2">2. Устройство операционной системы</a></li>
<li><a href="#sec-3">3. Разработка</a></li>
<li><a href="#sec-4">4. Администрирование</a>
<ul>
<li><a href="#sec-4-1">4.1. установка ОС из командной строки</a></li>
<li><a href="#sec-4-2">4.2. загрузка Linux через GRUB</a></li>
<li><a href="#sec-4-3">4.3. подсистемы</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Загрузка системы</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Архитектура ПК. Assembler.</b> Организация памяти. Адресация памяти. 
Взаимодействие микропроцессора и переферийных устройств. Прерывания и порты. 
Взаимодействие (вызов) программ на ассемблере друг с другом и с программами на других языках. 
</p>
<ul class="org-ul">
<li>Юров "Assembler". В частности, гл. "Архитектура ПК", "Прерывания", "Защищенный режим", "Обработка в защищенном режиме", "Модульное программирование" 
</li>
</ul>
<p>
<b>Загрузка системы.</b> Устройство MBR. Использование готового загрузчика для запуска ОС. Разработка своего загрузчика и загрузка минимальной ОС. 
</p>
<ul class="org-ul">
<li>статья "MBR для флешки"  
</li>
<li>статья "Как запустить программы без ОС"
</li>
<li>Brokenthron.com, "Operating System Development"
</li>
</ul>
<p>
прочее:  
</p>
<ul class="org-ul">
<li>Таненбаум "Архитектура ПК" 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Устройство операционной системы</h2>
<div class="outline-text-2" id="text-2">
<p>
Общие задачи операционной системы и детали реализации Linux, средства синхронизации, программирование под OC.
</p>
<ul class="org-ul">
<li>лекции "программирование для Linux" (Андрей Боровский, Linux Format)
</li>
<li>Робачевский "Операционная система UNIX"
</li>
</ul>
<p>
прочее:
</p>
<ul class="org-ul">
<li>описание OC xv6  
</li>
<li>Роберт Лав, "Разработка ядра Linux"
</li>
<li>D. Rusling, "Linux Kernel"
</li>
<li>очень подробное описание с описанием различий в реализациях разных Unix систем: Stevens, Rago, "Advanced programming in the Unix Environment"  
</li>
<li>Таненбаум, "Современные Операционные Системы"  
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Разработка</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Разработка модулей</b>  
</p>
<ul class="org-ul">
<li>практика по работе с ядром: Алексей Соловьев, "Разработка модулей ядра ОС Linux"
</li>
</ul>
<p>
<b>Сборка дистрибутива</b>
</p>
<ul class="org-ul">
<li>Сборка системы и обзор пакетов "Linux From Scratch"
</li>
</ul>
<p>
прочее:  
</p>
<ul class="org-ul">
<li>O'Reilly, "Linux Device Drivers" 
</li>
<li>Исходный код некоторых программ: Арнольд Роббинс, "Linux программирование в примерах". 
</li>
<li>Описание цикла разработки дистрибутива "Руководство начинающего разработчика Debian".   
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Администрирование</h2>
<div class="outline-text-2" id="text-4">
<p>
Общее о Linux: O'Reilly, "Running Linux"
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> установка ОС из командной строки</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Установка некоторых дистрибутивов производится из командной строки или 
с помощью текстового интерфейса и требует установки дополнительного ПО. 
К примеру:    
</p>
<ul class="org-ul">
<li>установка базового Arch Linux. Также X Windows, Window Manager
</li>
<li>установка базового Debian. Также видео-драйвера, X Windows, Window Manager     
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> загрузка Linux через GRUB</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Система Linux имеет несколько уровней загрузки и может загружаться с
разными ядрами. Разные варианты загрузки:
</p>
<ul class="org-ul">
<li>загрузчик GRUB имеет свой консольный режим 
</li>
<li>загрузка в консоль
</li>
<li>однопользовательский режим
</li>
<li>хак-загрузка с передачей параметра процессу init
</li>
<li>загрузка в другие разделы 
</li>
<li>загрузка/установка различных ядер
</li>
</ul>
<p>
Способы восстановления:
</p>
<ul class="org-ul">
<li>восстановление через консоль и chroot
</li>
<li>использование логов для восстановления после сбоя обновления. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> подсистемы</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>система репозиториев, apt-get; apt-mirror
</li>
<li>система инициализации, задания, автозагрузка 
</li>
<li>X-сервер, перенаправления
</li>
<li>хранение паролей
</li>
<li>права доступа; SELinux/AppArmor 
</li>
<li>работа с сетью из командной строки; iptables
</li>
<li>системы виртуализации Xen, Qemu/KVM
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yury</p>
<p class="date">Created: 2017-07-19 Wed 15:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
